app/controllers/quizzs_controller.rb

  def index
    @quizzs = Quizz.all
---
SELECT "quizzs".* FROM "quizzs"

  def create
    @quizz = Quizz.new(quizz_params)

    respond_to do |format|
      if @quizz.save
---
INSERT INTO "quizzs" ("question", "ans1", "ans2", "ans3", "ans4", "correctAns", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @quizz.update(quizz_params)
---
UPDATE "quizzs" SET "question" = ?, "ans2" = ?, "correctAns" = ?, "updated_at" = ? WHERE "quizzs"."id" = ?  [["question", "Capital of Usa?  "], ["ans2", "Seattle"], ["correctAns", 2], ["updated_at", "2015-07-01 10:14:03.025672"], ["id", 1]]

	def answering
	@quizzs = Quizz.all
---
SELECT "quizzs".* FROM "quizzs"

	def answer
	@quizz = Quizz.find(params[:id])
---
SELECT  "quizzs".* FROM "quizzs" WHERE "quizzs"."id" = ? LIMIT 1  [["id", 1]]

	def check
	@user = User.find(session[:user_id])
	@quizz = Quizz.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "quizzs".* FROM "quizzs" WHERE "quizzs"."id" = ? LIMIT 1  [["id", 1]]

    def set_quizz
      @quizz = Quizz.find(params[:id])
---
SELECT  "quizzs".* FROM "quizzs" WHERE "quizzs"."id" = ? LIMIT 1  [["id", 980190962]]