app/controllers/users_controller.rb

	def update
	@user = User.find(session[:user_id])
	if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$5YiuECnbKd10.sK1beJdXOO2rZjYIUtdCipp1DzFyp.iTpdyG0wrm"], ["updated_at", "2015-06-29 15:13:34.897070"], ["id", 10]]